/* 1553449 王志业 3班 */
#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <conio.h>
#include <ctime>
#include "11-b1-datetime.h"
using namespace std;

void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (_getch() != '\r')
		;
	cout << endl << endl;
}

/* ----main函数不准动，也不需要提交，检查时会替换（细节可能有错，如果发现请及时提出）---- */
int main()
{
	if (1) {
		DateTime d1;             //2000.1.1
		DateTime d2(2017, 5, 18, 5, 12, 36);  //2017.5.18 5:12:36

		cout << "测试初始化，完全正确的赋值" << endl;

		cout << "d1应该是2000.1.1 0:0:0， 实际为：";
		d1.show();
		cout << "d2应该是2017.5.18 5:12:36，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		DateTime d1(1870, 3, 15, 5, 12, 36);
		DateTime d2(2112, 3, 4, 5, 12, 36);
		DateTime d3(2005, 13, 15, 5, 12, 36);
		DateTime d4(2017, 2, 32, 5, 12, 36);
		DateTime d5(2017, 2, 32, 25, 12, 36);
		DateTime d6(2017, 2, 32, 5, 63, 36);
		DateTime d7(2017, 2, 32, 5, 12, 78);

		cout << "测试初始化，年、月、日、时、分、秒非法" << endl;

		cout << "d1应该是1900.1.1 00：00 ：00，实际为：";
		d1.show();
		cout << "d2应该是1900.1.1 00：00 ：00， 实际为：";
		d2.show();
		cout << "d3应该是1900.1.1 00：00 ：00，实际为：";
		d3.show();
		cout << "d4应该是1900.1.1 00：00 ：00， 实际为：";
		d4.show();
		cout << "d5应该是1900.1.1 00：00 ：00， 实际为：";
		d5.show();
		cout << "d6应该是1900.1.1 00：00 ：00， 实际为：";
		d6.show();
		cout << "d7应该是1900.1.1 00：00 ：00， 实际为：";
		d7.show();

		wait_for_enter();
	}

	if (1) {
		DateTime d1(2017, 2, 29, 5, 28, 59);
		DateTime d2(2016, 2, 29, 5, 28, 59);

		cout << "测试初始化，闰年" << endl;

		cout << "d1应该是1900.1.1 00：00 ：00， 实际为：";
		d1.show();
		cout << "d2应该是2016.2.29 05:28:59，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		DateTime d1;
		DateTime d2;
		DateTime d3;
		DateTime d4;
		DateTime d5;
		DateTime d6;
		DateTime d7;

		cout << "测试set，年、月、日、时、分、秒非法" << endl;

		d1.set(2112, 1, 1, 5, 58, 29);
		d2.set(2017, 2, 29, 5, 58, 29);
		d3.set(2017, 5, 32, 5, 58, 29);
		d4.set(2017, 13, 12, 5, 58, 29);
		d5.set(2017, 6, 4, 28, 31, 24);
		d6.set(2017, 6, 4, 14, 61, 59);
		d7.set(2017, 6, 4, 14, 26, 61);

		cout << "d1应该是1900.1.1 00：00 ：00，实际为：";
		d1.show();
		cout << "d2应该是1900.1.1 00：00 ：00， 实际为：";
		d2.show();
		cout << "d3应该是1900.1.1 00：00 ：00， 实际为：";
		d3.show();
		cout << "d4应该是1900.1.1 00：00 ：00，实际为：";
		d4.show();
		cout << "d5应该是1900.1.1 00：00 ：00，实际为：";
		d5.show();
		cout << "d6应该是1900.1.1 00：00 ：00，实际为：";
		d6.show();
		cout << "d7应该是1900.1.1 00：00 ：00，实际为：";
		d7.show();

		wait_for_enter();
	}


	if (1) {
		DateTime d1(2017, 6, 4, 14, 29, 31);
		DateTime d2;

		cout << "测试cout" << endl;
		cout << "d1应该是2017.5.18，14:29:31实际为：" << d1 << endl;
		cout << "d2应该是1900.1.1 00:00:00， 实际为：" << d2 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1;

		cout << "测试cin/cout" << endl;

		cout << "请输入2017 5 18 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是2017.5.18 14:30:15，实际为：" << d1 << endl;

		cout << "请输入2016 2 29 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是2016.2.29，14:30:15实际为：" << d1 << endl;

		cout << "请输入2017 2 29 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入1899 4 10 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2017 13 10 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2017 4 31 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2112 15 34 14 30 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2017 5 18 24 30 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2017 5 18 13 61 15" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2017 5 18 23 30 61" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1 00:00:00，实际为：" << d1 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1(1);          //1900.1.1
		DateTime d2(-3600 * 24);      //2099.12.31
		DateTime d3(-1);       //1900.1.1
		DateTime d4(3600 * 24);      //2099.12.31

		cout << "转换构造函数测试，包括合法及非法值" << endl;
		cout << "d1应该是1900.1.1 00:00:00  实际为：";
		d1.show();
		cout << "d2应该是2099.12.30 00:00:00，实际为：";
		d2.show();
		cout << "d3应该是2099.12.30 23:59:59，  实际为：";
		d3.show();
		cout << "d4应该是1900.1.1 23:59:59，实际为：";
		d4.show();

		wait_for_enter();
	}

	if (1) {
		DateTime d1(2017, 5, 18, 23, 59, 59);
		DateTime d2;

		cout << "测试+/- n" << endl;

		d2 = d1 + (_int64)1;
		cout << "d2应该是2017.5.19 00:00:00 ， 实际为：" << d2 << endl;


		d2 = d1 - (_int64)7;
		cout << "d2应该是2017.5.18，23:59:52 实际为：" << d2 << endl;

		d1.set(2016, 2, 29, 0, 0, 0);
		d2 = d1 - (_int64)1;
		cout << "d2应该是2016.2.28 ， 23:59:59  实际为：" << d2 << endl;

		d1.set(2099, 12, 31, 23, 59, 59);
		d2 = d1 + (_int64)1;
		cout << "d2应该是1900.1.1 00:00:00，  实际为：" << d2 << endl;

		d1.set(2010, 12, 28, 16, 24, 35);
		d2 = d1 + (_int64)(60 * 60 * 24 + 1);
		cout << "d2应该是2010.12.29，16:24:35  实际为：" << d2 << endl;

		d2 = d1 - (_int64)(60 * 60 * 24 + 1);
		cout << "d2应该是2010.12.27，16:24:34实际为：" << d2 << endl;

		d1.set(2009, 1, 1, 0, 0, 0);
		d2 = d1 + (_int64)(365 * 60 * 60 * 24 + 1);
		cout << "d2应该是2010.1.1，00:00:00实际为：" << d2 << endl;

		d1.set(1900, 1, 2, 0, 0, 0);
		d2 = d1 + (_int64)(30 * 60 * 60 * 24 + 1);
		cout << "d2应该是1900.2.1，00:00:00  实际为：" << d2 << endl;

		d1.set(2017, 5, 18, 23, 59, 59);
		d2.set(2017, 5, 19, 0, 0, 0);
		cout << "d1-d2应该是-1，实际为：" << d1 - d2 << endl;

		d1.set(2017, 5, 19, 0, 0, 0);
		d2.set(2017, 5, 18, 23, 59, 59);
		cout << "d1-d2应该是1，实际为：" << d1 - d2 << endl;

		d1.set(2017, 5, 20, 0, 0, 0);
		d2.set(2017, 5, 19, 0, 0, 0);
		cout << "d1-d2应该是86400，实际为：" << d1 - d2 << endl;

		wait_for_enter();
	}

	if (1) {
		Date d1(2017, 5, 1);
		Date d2(2017, 3, 11);

		cout << "测试-date" << endl;
		cout << "日期差值应为51， 实际为：" << d1 - d2 << endl;

		d2.set(2017, 5, 23);
		cout << "日期差值应为-22，实际为：" << d1 - d2 << endl;

		d1.set(2016, 3, 2);
		d2.set(2016, 2, 27);
		cout << "日期差值应为4，  实际为：" << d1 - d2 << endl;

		d1.set(2017, 3, 2);
		d2.set(2017, 2, 27);
		cout << "日期差值应为3，  实际为：" << d1 - d2 << endl;

		d1.set(2017, 1, 2);
		d2.set(2016, 12, 27);
		cout << "日期差值应为6，  实际为：" << d1 - d2 << endl;

		d1.set(2015, 1, 1);
		d2.set(2013, 12, 31);
		cout << "日期差值应为366，实际为：" << d1 - d2 << endl;

		d1.set(2017, 1, 1);
		d2.set(2015, 12, 31);
		cout << "日期差值应为367，实际为：" << d1 - d2 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime d1, d2;

		cout << "测试++/--" << endl;

		d1.set(2017, 5, 18, 18, 38, 24);
		d2 = d1++;
		cout << "d1应该是2017.5.18，18:38:25  实际为：" << d1 << endl;
		cout << "d2应该是2017.5.18，18:38:24  实际为：" << d2 << endl;

		d1.set(2017, 5, 18, 18, 38, 24);
		d2 = ++d1;
		cout << "d1应该是2017.5.18，18:38:25  实际为：" << d1 << endl;
		cout << "d2应该是2017.5.18，18:38:25  实际为：" << d2 << endl;

		d1.set(2017, 5, 1, 18, 38, 0);
		d2 = d1--;
		cout << "d1应该是2017.5.18，18:37:59 实际为：" << d1 << endl;
		cout << "d2应该是2017.5.18，18:38:0  实际为：" << d2 << endl;

		d1.set(2017, 5, 1, 18, 38, 0);
		d2 = --d1;
		cout << "d1应该是2017.5.18，18:37:59 实际为：" << d1 << endl;
		cout << "d2应该是2017.5.18，18:37:59 实际为：" << d2 << endl;

		d1.set(2016, 12, 30, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是2016.12.31 ,00:00:00  实际为：" << d1 << endl;
		cout << "d2应该是2016.12.30，23:59:59 实际为：" << d2 << endl;

		d1.set(2017, 1, 2, 0, 0, 0);
		d2 = d1--;
		cout << "d1应该是2017.1.1，23:59:59  实际为：" << d1 << endl;
		cout << "d2应该是2017.1.2，00:00:00  实际为：" << d2 << endl;

		d1.set(2016, 12, 31, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是2017.1.1，00:00:00 实际为：" << d1 << endl;
		cout << "d2应该是2016.12.31，23:59:59 实际为：" << d2 << endl;

		d1.set(2017, 2, 28, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是2017.3.1， 00:00:00 实际为：" << d1 << endl;
		cout << "d2应该是2017.2.28，23:59:59 实际为：" << d2 << endl;

		d1.set(2099, 12, 31, 23, 59, 59);
		d2 = d1++;
		cout << "d1应该是1900.1.1， 00:00:00实际为：" << d1 << endl;
		cout << "d2应该是2099.12.31,23:59:59实际为：" << d2 << endl;

		d1.set(1900, 1, 1, 0, 0, 0);
		d2 = d1--;
		cout << "d1应该是2099.12.31，23:59:59  实际为：" << d1 << endl;
		cout << "d2应该是1900.1.1，00:00:00  实际为：" << d2 << endl;

		wait_for_enter();
	}


	if (1) {
		/* 测试比较运算符 */
		DateTime d1(2017, 5, 18, 18, 53, 20);
		DateTime d2(2017, 5, 18, 18, 53, 20);
		DateTime d3(2016, 4, 27, 18, 53, 20);

		cout << "测试比较运算符" << endl;

		cout << "比较结果应为0，实际为：" << (d1 > d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 >= d2) << endl;
		cout << "比较结果应为0，实际为：" << (d1 < d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 <= d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 == d2) << endl;
		cout << "比较结果应为0，实际为：" << (d1 != d2) << endl;

		cout << "比较结果应为1，实际为：" << (d1 > d3) << endl;
		cout << "比较结果应为1，实际为：" << (d1 >= d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 < d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 <= d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 == d3) << endl;
		cout << "比较结果应为1，实际为：" << (d1 != d3) << endl;

		wait_for_enter();
	}

	return 0;
}